Tekla.Structures.Filtering.Categories.WeldFilterExpressions.WeldingSite
The WeldingSite class represents the welding site filter expression.

Tekla.Structures.Filtering.Categories.WeldFilterExpressions.WeldingSite.#ctor
Initializes a new instance of the WeldingSite class.